-- noinspection SqlDialectInspectionForFile
-- noinspection SqlNoDataSourceInspectionForFile

INSERT INTO role(name)
VALUES ("admin"),
       ("user");

INSERT INTO user(name,
                 email,
                 password,
                 locale,
                 phone_number,
                 role_id,
                 blocked)
VALUES ("Yevhen Hryhoriev",
        "hryhoriev75@gmail.com",
        "7b97b3938265d4f9448b6d855b48b44bf16935bc14864820f530b3fb7140ad0c1b9834b14c6120a9f525d692b58eb714d90d8f2312384d29247584425827c0f0e16e647a4360801b9ee4b7b6753db27212345678",
        "uk",
        "",
        1,
        0),
       ("Jane Doe",
        "jane.doe@gmail.com",
        "a9aceb402bec607e9b87e2d25f3bd4e35756ace160069a2f8664cad93f368e9f1a716b29ede9ee64b4267a84b4b8390e78d7369b6dc45690961a5e91f16da2984cc12163e9afa063627bd11b1ef7c8f8",
        "ua",
        "+380501234567",
        2,
        0);

INSERT INTO category (name,
                      description)
VALUES ("Шурупокрути",
        "Шурупокрути — ручний електричний інструмент, який має бути в кожній оселі. Крім того, його часто купують для професійних майстерень. Головна функція цього інструмента — закручування та викручування саморізів, шурупів, гвинтів та інших типів кріплень. Шурупокрути активно застосовуються при ремонтних роботах та у будівництві."),
       ("Болгарки",
        "Болгарки або шліфувальні машини — електричний ручний інструмент для шліфування та полірування поверхонь з різних матеріалів. Ними можна обробляти деревину, метал, пластик та скло, усуваючи з їх поверхні подряпини, нерівності та інші дефекти. Існує декілька типів шліфувального інструмента, які відрізняються особливостями впливу на поверхню деталі, що обробляється."),
       ("Перфоратори",
        "Перфоратори — ударний ручний електроінструмент, який використовується для будівельних робіт: свердління отворів, монтажу та демонтажу конструкцій, штроблення, буріння і т.п. Це обладнання використовує енергію удару, щоб руйнувати бетон, граніт, цеглу та інші тверді матеріали."),
       ("Дрилі та міксери",
        "Електродриль — інструмент, який використовується для свердління отворів у різних матеріалах. Всередині дриля встановлено двигун, який передає обертання патрону зі встановленою насадкою (свердлом) за допомогою редуктора. Дрилі активно використовуються на будівельних майданчиках, а також корисні для виконання різних завдань в побуті. Обертання може відбуватися в будь-яку сторону, завдяки функції реверсу.
        Міксери будівельні — це ручний електроінструмент, який відноситься до категорії будівельного обладнання. Він використовується для розмішування будівельних сумішей та розчинів, в’язких та густих сумішей. Це обладнання може відрізнятися по кількості вінчиків, потужності та наявності додаткових функцій. Без міксера складно обійтися при домашньому ремонті та в професійному будівництві."),
       ("Пили та плиткорізи",
        "Циркулярні ручні пили — це мобільний ріжучий інструмент, який використовується для розпилювання дощок, бруса, алюмінію, пластику та різних деталей без прив’язки до робочого столу. Крім ручних, існують також настільні циркулярні дискові пили, що представляють собою повноцінні деревооброблюючі верстати (циркулярні пили з підставкою).
        Електричний плиткоріз — інструмент з невеликою потужністю, який використовується для різання плитки або кафелю. Ви може працювати як з настінною так і підлоговою плиткою, виконуючи прямий або діагональний різ. В якості розхідного матеріалу в плиткоріз встановлюються алмазні диски."),
       ("Електролобзики",
        "Електролобзики — електричний ручний інструмент зі зворотно-поступальним рухом пилки. Вони використовуються для розпилювання різноманітних будівельних матеріалів: деревини, м’яких металів, пластмаси, гіпсокартону та інших. В якості витратників для них використовуються пилки. В залежності від оброблюванного матеріалу потрібно підібрати відповідний тип пиляльного полотна. Ви знайдете в нашому каталозі побутові та професійні електролобзики."),
       ("Фрезери",
        "Фрезер — ручний деревообробний електроінструмент. Він використовується для профілювання кромок дерев’яних виробів, свердління сліпих та сквозних отворів, створення пазів. Фрезер також знадобиться при обробці таких матеріалів, як пластик та штучний камінь, акрил, епоксидна смола, гіпс та навіть деякі види м’яких металів. Для кожного матеріалу призначені свої налаштування швидкості та спеціальні типи фрез. Електричні кромочні фрезери можна використовувати вдома або в майстернях. Область їх застосування включає обробку кромок, створення та фрезерування пазів, виготовлення меблів та декоративних деталей. Це обладнання використовують столяри, меблярі, теслі та декоратори. При роботі з ним використовуються різні види фрез."),
       ("Електрорубанки",
        "Електрорубанки — ручний електроінструмент, призначений для вирівнювання поверхонь з дерева після первинної грубої обробки. За допомогою рубанка можна зробити поверхню виробу або заготовки рівною, усунути дефекти та нерівності. Обладнання не призначене для точних робіт — це інструмент для проміжної обробки перед початком фінішних робіт. Рубанки використовують під час ремонту або при виготовленні дерев’яних виробів."),
       ("Будівельні фени",
        "Будівельний фен — багатофункціональний електроінструмент, який широко використовується на будівельних майданчиках, при ремонті та в майстернях. Він може виконувати наступні задачі:
        видалення або сушка лаку та фарби;
        швидке зняття шпалер та наліпок;
        розморожування замерзлих трубопроводів;
        нагрів невеликих приміщень;
        спаювання та згинання труб.");

INSERT INTO product(name,
                    brand,
                    description,
                    create_time,
                    price,
                    image_url,
                    category_id)
VALUES ("Акумуляторний дриль-шурупокрут Bosch EasyDrill 1200 2 акумулятори",
        "Bosch",
        "Акумуляторний дриль-шурупокрут Bosch EasyDrill 1200.
Особливості:
Syneon Chip: інтелектуальна система електронного керування енергією для забезпечення оптимальної потужності та максимальної витривалості
Без ефекту пам''яті та саморозряду: постійна готовність до експлуатації завдяки літій-іонній технології
Компактна конструкція завдяки літій-іонній технології
Електронне керування частотою обертання Bosch Electronic: Функція «Розгону» від 0 до макс. за допомогою кнопкового вимикача
Потужний планетарний редуктор: тривалий термін служби, оптимальне передавання зусилля, висока плавність ходу
PowerLight — завдяки вбудованому світлодіоду ваша робоча зона завжди буде добре освітлена
15-ступінчасте установлення крутного моменту + щабель для свердління — оптимальна потужність для будь-якого застосування",
        '2021-03-25 00:01:10',
        2599,
        "https://i2.rozetka.ua/goods/10128204/bosch_06039a210b_images_10128204791.jpg",
        1),
       ("Дриль-шурупокрут Sturm ID2155DFR",
        "Sturm",
        "Дриль-шурупокрут Sturm ID2155DFR — інструмент професійного рівня з крутним моментом 45 Нм, аналогів якому на ринку практично немає. Має швидкозатискний патрон і функцію блокування шпинделя, що заощаджує час під час заміни обладнання, а також дає змогу м''яко докрутити саморіз без вмикання двигуна. Ручка має м''які накладки, що знижують вібрацію — для комфортної роботи користувача. За допомогою спеціальної муфти можна виставити необхідне значення крутного моменту для робіт із матеріалом конкретної щільності. Усього на вибір є 22 позиції плюс режим свердління. Перевагою цієї моделі є мережевий кабель завдовжки 4 метри, виготовлений із м''якого еластичного матеріалу.
Особливості:
Швидкознімний патрон для швидкої заміни обладнання;
Кабель завдовжки 4 м;
Блокування шпинделя для зручної заміни біт і м''якого докручування;
Крутний момент 45 Нм;
Планетарний редуктор підвищеної міцності;
Швидкий доступ до заміни вугільних щіток;
Професійна серія — дає змогу безперервно працювати апаратом утричі довше ніж аналогічною машиною побутового рівня збірки;
Гарантія: 36 місяців;",
        '2021-03-25 00:01:15',
        1150,
        "https://i2.rozetka.ua/goods/15289289/sturm_id2155dfr_images_15289289709.jpg",
        1),
       ("Акумуляторний дриль-шурупокрут Makita DF333DWYE",
        "Makita",
        "Дуже компактний і легкий
Вбудована світлодіодна підсвітка полегшує роботу в темряві
Металевий редуктор
Зручно розташований перемикач реверса
Швидкозатискний патрон і автоматичне блокування шпинделя забезпечує легку заміну біти однією рукою
Зручна ергономічна ручка забезпечує високу ефективність роботи з інструментом
Регулятор числа обертів
Підшипник шпинделя для надійності та точності",
        '2021-03-25 00:01:20',
        2815,
        "https://i2.rozetka.ua/goods/14530742/makita_df333dwye_images_14530742328.jpg",
        1),
       ("Електрична викрутка Xiaomi Wiha Zu Hause Electric Screwdriver + 8 насадок",
        "Xiaomi",
        "Електрична викрутка Xiaomi Wiha Zu Hause Electric Screwdriver — це електрична викрутка з високою якістю й точністю виготовлення. Викрутка обладнана ємним акумулятором на 1500 мА·год і корпусом із якісного інженерного пластику з високими показниками термостійкості й ударостійкості.
За допомогою цього інструмента, ви зможете легко загвинчувати та відгвинчувати кріпильні вироби з різзю: шурупи, гвинти та саморізи. Цей інструмент стане в пригоді скрізь — на дачі, удома, у гаражі. Він допоможе в складанні/розбиранні меблів, під час ремонту електроніки, установленні вимикачів і розеток.
Електрична викрутка Xiaomi Wiha Zu Hause має два режими роботи: електричний і ручний.
В електричному режимі є два різновиди крутного моменту 0.4 Нм/1 Нм. 0.4 Нм відповідає підсвітці зеленого кольору (більше підходить для збирання й розбирання побутової техніки), а 1 Нм відповідає підсвітці оранжевого кольору (більше підходить для збирання й розбирання меблів).",
        '2021-03-25 00:01:23',
        1099,
        "https://i2.rozetka.ua/goods/16659090/xiaomi_zuhause_4129_images_16659090883.jpg",
        1),
       ("Акумуляторна викрутка Bosch IXO IV Medium",
        "Bosch",
        "Акумуляторна викрутка Bosch IXO V — легкий і компактний інструмент для загвинчування і відгвинчування кріплень у побутових ситуаціях. У комплект входять зарядний пристрій і 10 змінних робочих насадок. Мініатюрний літій-іонний акумулятор не має ефект пам''яті та саморозряджання. Світлодіодне підсвічування робочої зони, індикатор заряджання акумулятора та напрямку обертання.
Риси:
Світлодіодний індикатор напрямку обертання та заряджання акумулятора
Автоматичне блокування шпинделя для ручного затягування або ослаблення шурупів
У зарядному пристрої також передбачений зручний відсік для зберігання
Ручка з м''якою накладкою для надійнішого та зручнішого захоплення",
        '2021-03-25 00:01:45',
        2599,
        "https://i2.rozetka.ua/goods/10017404/bosch_06039a8021_images_10017404339.jpg",
        1);